In [1]:
#Ex 1.1 Creating and Manipulating DataFrames:

In [24]:
import numpy as np
import pandas as pd

In [26]:
student_data = pd.DataFrame({'Name':['Alice', 'Bob', 'Charlie', 'David', 'Eva'],'Age':[23,25,22,24,23],'Gender':['F','M','M','M','F'],'Score':[85,78,92,70,88]})
student_data.head(3)

      Name  Age Gender  Score
0    Alice   23      F     85
1      Bob   25      M     78
2  Charlie   22      M     92

In [28]:
student_data[student_data['Gender']=='F']

    Name  Age Gender  Score
0  Alice   23      F     85
4    Eva   23      F     88

In [30]:
student_data['Score1']=student_data['Score']
student_data

      Name  Age Gender  Score  Score1
0    Alice   23      F     85      85
1      Bob   25      M     78      78
2  Charlie   22      M     92      92
3    David   24      M     70      70
4      Eva   23      F     88      88

In [32]:
student_data['Score2']=student_data['Score']
student_data

      Name  Age Gender  Score  Score1  Score2
0    Alice   23      F     85      85      85
1      Bob   25      M     78      78      78
2  Charlie   22      M     92      92      92
3    David   24      M     70      70      70
4      Eva   23      F     88      88      88

In [34]:
student_data['Age1'] = student_data['Age']
student_data

      Name  Age Gender  Score  Score1  Score2  Age1
0    Alice   23      F     85      85      85    23
1      Bob   25      M     78      78      78    25
2  Charlie   22      M     92      92      92    22
3    David   24      M     70      70      70    24
4      Eva   23      F     88      88      88    23

In [36]:
student_data = student_data.drop(columns=['Score1','Score2'],axis=1)
student_data

      Name  Age Gender  Score  Age1
0    Alice   23      F     85    23
1      Bob   25      M     78    25
2  Charlie   22      M     92    22
3    David   24      M     70    24
4      Eva   23      F     88    23

In [38]:
student_data = student_data.drop(3,axis=0)
student_data

      Name  Age Gender  Score  Age1
0    Alice   23      F     85    23
1      Bob   25      M     78    25
2  Charlie   22      M     92    22
4      Eva   23      F     88    23

In [40]:
d =student_data[(student_data['Gender']=='F') & (student_data['Score']>85)]
d

  Name  Age Gender  Score  Age1
4  Eva   23      F     88    23

In [42]:
student_data.sort_values(by=['Score'],ascending=False)

      Name  Age Gender  Score  Age1
2  Charlie   22      M     92    22
4      Eva   23      F     88    23
0    Alice   23      F     85    23
1      Bob   25      M     78    25

In [44]:
def fillgrade(s):
    if s>=90:
        return 'A'
    elif s>=80 and s<90:
        return 'B'
    elif s>=70 and s<80:
        return 'C'
    else:
        return 'D'

student_data['Grade'] = student_data['Score'].apply(fillgrade)
student_data

      Name  Age Gender  Score  Age1 Grade
0    Alice   23      F     85    23     B
1      Bob   25      M     78    25     C
2  Charlie   22      M     92    22     A
4      Eva   23      F     88    23     B

In [46]:
#Ex 1.2 DataFrame Operations:

In [90]:
df2 = pd.DataFrame({'Month':['Jan','Feb','Mar','Jan','Feb','Mar'],
                     'Product':['A','A','A','B','B','B'],
'Sales': [150, 200, 250, 300, 400, 500]})
df2

  Month Product  Sales
0   Jan       A    150
1   Feb       A    200
2   Mar       A    250
3   Jan       B    300
4   Feb       B    400
5   Mar       B    500

In [92]:
p = df2.groupby('Product')['Sales'].sum()
p.head()

Product
A     600
B    1200
Name: Sales, dtype: int64

In [154]:
df2.loc[df2.groupby('Product')['Sales'].idxmax()]

  Month Product  Sales
2   Mar       A    250
5   Mar       B    500

In [160]:
total_sales = df2['Sales'].sum()
df2['Sales_Percentage'] =(df2['Sales']/total_sales)*100
df2

  Month Product  Sales  Sales_Percentage
0   Jan       A    150          8.333333
1   Feb       A    200         11.111111
2   Mar       A    250         13.888889
3   Jan       B    300         16.666667
4   Feb       B    400         22.222222
5   Mar       B    500         27.777778

In [162]:
# Ex1.3 Handling missing data

In [180]:
df3 = pd.DataFrame({'Name': ['John', 'Doe', 'Jane', 'Anna', 'Smith'],
'Department': ['HR', 'Finance', None, 'IT', 'HR'],
'Salary': [50000, 60000, 55000, None, 58000]
})
df3

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane       None  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [182]:
df3.isnull().sum()

Name          0
Department    1
Salary        1
dtype: int64

In [188]:
df3['Department'] = df3['Department'].fillna(df3['Department'].mode()[0])
df3

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [190]:
df3['Salary'] = df3['Salary'].fillna(df3['Salary'].mean())
df3

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [192]:
df3 = df3.dropna()
df3

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [194]:
# Ex 1.4 Series Operations

In [196]:
temp = pd.Series([23, 21, 20, 25, 27, 30, 28, 22, 24, 26])
temp

0    23
1    21
2    20
3    25
4    27
5    30
6    28
7    22
8    24
9    26
dtype: int64

In [198]:
mean_val = temp.mean()
mean_val

24.6

In [200]:
median_val = temp.median()
median_val

24.5

In [202]:
std_val = temp.std()
std_val

3.204163957519444

In [208]:
temperature_celcius = (temp - 32) * 5/9
temperature_celcius

0   -5.000000
1   -6.111111
2   -6.666667
3   -3.888889
4   -2.777778
5   -1.111111
6   -2.222222
7   -5.555556
8   -4.444444
9   -3.333333
dtype: float64

In [210]:
temp.idxmax()

5

In [212]:
temp.idxmin()

2

In [216]:
temp.sort_values(ascending=True)

2    20
1    21
7    22
0    23
8    24
3    25
9    26
4    27
6    28
5    30
dtype: int64

In [218]:
temp.sort_values(ascending=False)

5    30
6    28
4    27
9    26
3    25
8    24
0    23
7    22
1    21
2    20
dtype: int64

In [220]:
#Ex 1.5 Merging dataframes

In [222]:
orders = pd.DataFrame({'OrderID': [1, 2, 3, 4, 5],
'CustomerID': [101, 102, 103, 104, 101],
'Product': ['A', 'B', 'A', 'C', 'B']
})
orders

   OrderID  CustomerID Product
0        1         101       A
1        2         102       B
2        3         103       A
3        4         104       C
4        5         101       B

In [224]:
customers = pd.DataFrame({'CustomerID': [101, 102, 103, 104],
'Name': ['Alice', 'Bob', 'Charlie', 'David'],
'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston']
})
customers

   CustomerID     Name     Location
0         101    Alice     New York
1         102      Bob  Los Angeles
2         103  Charlie      Chicago
3         104    David      Houston

In [226]:
merged = pd.merge(orders,customers, on="CustomerID") 
merged

   OrderID  CustomerID Product     Name     Location
0        1         101       A    Alice     New York
1        2         102       B      Bob  Los Angeles
2        3         103       A  Charlie      Chicago
3        4         104       C    David      Houston
4        5         101       B    Alice     New York

In [234]:
grouped = merged.groupby('Location')['Name'].sum()
grouped

Location
Chicago           Charlie
Houston             David
Los Angeles           Bob
New York       AliceAlice
Name: Name, dtype: object